; domain
;PEOPLE might need food crates, meds crates, or both
;ROBOT can move between locations, can go back to base (depot) directly; 
;can load crates
;CRATES in depot are supposed to contain either food or meds; can be picked
;up and delivered by the ROBOT.

(define (domain crateDHL)

;remove requirements that are not needed
(:requirements :typing)

(:types 
    robot crate person location
    ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
)

; un-comment following line if constants are needed
(:constants
    depot - location
)

(:predicates 
    ;crates
    (contains_food ?c - crate)              ;crate ?c contains food
    (contains_meds ?c - crate)              ;crate ?c contains meds
    (lays ?c - crate ?l - location)         ;crate ?c lays at location ?l
    (is_available ?c - crate)                   ;crate can be loaded
    ;robot
    (is_at_loc ?r - robot ?l - location)    ;robot ?r is at location ?l
    (is_empty ?r - robot)                   ;robot ?r is empty
    (is_loaded ?r - robot ?c - crate)       ;robot ?r is loaded with crate ?c
    ;people
    (is_at ?p - person ?l - location)       ;person ?p is at location ?l
    (needs_food ?p - person)                ;person ?p needs food
    (needs_meds ?p - person)                ;person ?p needs meds
    (food_served ?p - person)                 ;person ?p has been served
    (meds_served ?p - person)                 ;person ?p has been served

    )


(:functions ;todo: define numeric functions here
)

;;move robot from location ?l1 to location ?l2
;;where l1 --> initial loc ; l2 --> arrival loc
(:action move
    :parameters (?r - robot ?l1 ?l2 - location)
    :precondition (and (is_at_loc ?r ?l1))
    :effect (and (is_at_loc ?r ?l2)(not (is_at_loc ?r ?l1)))
)

;;send robot back to base (depot)
;(:action back_to_base
;    :parameters (?l ?depot - location ?r - robot)
;    :precondition (and (is_at_loc ?r ?l))
;    :effect (and (is_at_loc ?r ?depot)(not (is_at_loc ?r ?l)))
;)

;;loads meds crate
(:action load_meds_crate
    :parameters (?l - location ?c - crate ?r - robot)
    :precondition (and (is_at_loc ?r ?l)(is_empty ?r)(lays ?c ?l)(is_available ?c))
    :effect (and (is_loaded ?r ?c)(not (is_empty ?r))
        (not (lays ?c ?l))
    )
)

;;loads food crate
(:action load_food_crate
    :parameters (?l - location ?c - crate ?r - robot)
    :precondition (and (is_at_loc ?r ?l)(is_empty ?r)(lays ?c ?l)(is_available ?c))
    :effect (and (is_loaded ?r ?c)(not (is_empty ?r))
        (not (lays ?c ?l))
    )
)

;;deliver food crate
(:action deliver_food_crate
    :parameters (?r - robot ?c - crate ?l - location ?p - person)
    :precondition (and 
        (is_at_loc ?r ?l)(is_at ?p ?l)(is_loaded ?r ?c)(needs_food ?p)
        )
    :effect (and 
        (is_empty ?r)(food_served ?p)(lays ?c ?l)
        (not (is_loaded ?r ?c))(not (needs_food ?p))(not (is_available ?c))
    )
)

;;deliver meds crate
(:action deliver_meds_crate
    :parameters (?r - robot ?c - crate ?l - location ?p - person)
    :precondition (and 
        (is_at_loc ?r ?l)(is_at ?p ?l)(is_loaded ?r ?c)(needs_meds ?p)(contains_meds ?c)
        )
    :effect (and 
        (is_empty ?r)(meds_served ?p)(lays ?c ?l)
        (not (is_loaded ?r ?c))(not (needs_meds ?p))(not (is_available ?c))
    )
)


)

; problem
(define (problem problem1) (:domain crateDHL)
(:objects 
    l1 l2 l3 - location
    john alice marco - person
    c1 c2 c3 c4 c5 - crate
    r - robot

)

(:init
    ;crates at depot
    (lays c1 depot)
    (lays c2 depot)
    (lays c3 depot)
    (lays c4 depot)
    (lays c5 depot)
    ;crates content
    (contains_food c1)
    (contains_food c2)
    (contains_meds c3)
    (contains_meds c4)
    (contains_meds c5)
    ;availability
    (is_available c1)
    (is_available c2)
    (is_available c3)
    (is_available c4)
    (is_available c5)

    ;robot at depot
    (is_at_loc r depot)
    (is_empty r)

    ;people at depot
    (is_at john l1)
    (is_at alice l2)
    (is_at marco l2)
    
    ;needs
    (needs_food marco)
    (needs_meds marco)
    (needs_meds alice)


)

(:goal (and
    (food_served marco)
    (meds_served marco)
    (meds_served alice)
))

)

; plan
1. (load_food_crate depot c5 r)
   deleted: (is_empty r) (lays c5 depot)
   added: (is_loaded r c5)
   goals met: 0 of 3
2. (move r depot l2)
   deleted: (is_at_loc r depot)
   added: (is_at_loc r l2)
   goals met: 0 of 3
3. (deliver_food_crate r c5 l2 marco)
   deleted: (is_loaded r c5) (needs_food marco) (is_available c5)
   added: (is_empty r) (food_served marco) (lays c5 l2)
   goals met: 1 of 3
4. (move r l2 depot)
   deleted: (is_at_loc r l2)
   added: (is_at_loc r depot)
   goals met: 1 of 3
5. (load_food_crate depot c4 r)
   deleted: (is_empty r) (lays c4 depot)
   added: (is_loaded r c4)
   goals met: 1 of 3
6. (move r depot l2)
   deleted: (is_at_loc r depot)
   added: (is_at_loc r l2)
   goals met: 1 of 3
7. (deliver_meds_crate r c4 l2 alice)
   deleted: (is_loaded r c4) (needs_meds alice) (is_available c4)
   added: (is_empty r) (meds_served alice) (lays c4 l2)
   goals met: 2 of 3
8. (move r l2 depot)
   deleted: (is_at_loc r l2)
   added: (is_at_loc r depot)
   goals met: 2 of 3
9. (load_food_crate depot c3 r)
   deleted: (is_empty r) (lays c3 depot)
   added: (is_loaded r c3)
   goals met: 2 of 3
10. (move r depot l2)
   deleted: (is_at_loc r depot)
   added: (is_at_loc r l2)
   goals met: 2 of 3
11. (deliver_meds_crate r c3 l2 marco)
   deleted: (is_loaded r c3) (needs_meds marco) (is_available c3)
   added: (is_empty r) (meds_served marco) (lays c3 l2)
   goals met: 3 of 3
